---
kind: property
id: P:Autodesk.Revit.DB.TextNode.IsUnderlined
source: html/9a6b4898-8273-151a-b70e-69314b14bef3.htm
---
# Autodesk.Revit.DB.TextNode.IsUnderlined Property

Indicates whether the default formatting is set to underlined text.

## Syntax (C#)
```csharp
public bool IsUnderlined { get; }
```